_notes/_posts/technology/2021-11-27-sexp-operations-in-emacs.org
#+BEGIN_EXPORT html
---
layout: post
title: s-exp operations in emacs
categories: [technology]
tags: [lisp, clojure, emacs]
---
#+END_EXPORT

Structural editing is very useful for lisp dialect languages, such as
emacs-lisp, scheme, clojure and so on. Vanilla emacs ships Lisp
editing commands for Emacs(lisp.el) and [[https://github.com/Fuco1/smartparens][smartparens]] provides a minor
mode for Emacs that deals with parens pairs and tries to be smart
about it. If we combine the power of lisp.el and smartparens, we will
gain super productivity.

Let's demo these keys and functions with code examples.

* Navigation

~down-lisp(C-M-d)~ will go down from ❶ to ❷ ❸ ❹ till ❺, and stop at ❺,
because there is no inner place to go.

~sp-down-sexp~ from smartparens achieves the same thing as ~lisp-down~.

#+begin_example
❶(❷deftest size-test
  (❸let [❹ndm (❺nd/new-base-manager)]
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~backward-up-list(C-M-u)~ will move the point backward, in from of each
parenthesis. If the point starts from ❺, wherever inside the internal
expression, it will move to ❹ ❸ ❷ ❶, respectively on each press of
~C-M-u~.

#+begin_example
❶(deftest size-test
  ❷(let ❸[ndm ❹(nd/new-ba❺se-manager)]
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~up-list~ is actually ~forward-up-list~, if compares to ~backward-up-list~~,
it will let the point move forward out of one level of parentheses,
from ❶, wherever inside the internal expression, to ❷ ❸ ❹ till ❺. This
function is not bound to any keys as default.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-ba❶se-manager)❷]❸
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100)))))❹)❺
#+end_example

~forward-sexp (C-M-f)~ will move forward across one balanced expression (sexp).

Continue press ~C-M-f~, will move point from ❶ to ❷ and ❸, and stop at
❸. While the smartparens version ~sp-forward-sexp~, will jump one level
out from ❸.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    ❶(is (= 0 (nd/size (nd/arange ndm 0 0))))❷
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))❸))
#+end_example

~backward-sexp (C-M-b)~ move backward across one balanced expression (sexp).

The point will move from ❶ to ❺, and stop here, because there is no
backward sexp at the same level.

~sp-backward-sexp~ will jump one level up.

#+begin_example
(deftest size-test
 (❺let ❹[ndm (nd/new-base-manager)]
   ❸(is (= 0 (nd/size (nd/arange ndm 0 0))))
   ❷(is (= 100
           (nd/size (nd/arange ndm 0 100))))❶))
#+end_example

~beginning-of-defun (C-M-a)~ move backward to the beginning of a
defun. Actually, it moves to the beginning of whatever a top level
parenthesis.

~end-of-defun (C-M-e)~ move forward to next end of defun, at the next
line of last ~)~ of the defun.

From anywhere between ❶ and ❷, ~C-M-a~ will move the point to ❶ and
~C-M-e~ moves it to ❷:

#+begin_example
❶(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
❷
#+end_example

* Mark

~mark-sexp (C-M-SPC)~ can be used to mark next sexp and more if
repeatedly pressed.

If the cursor is at ❶, press ~C-M-SPC~ once will mark the region from ❶
to ❷, press twice, will mark the region from ❶ to ❸.

~sp-mark-sexp~ works the same as this function.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   ❶(is (= 0 (nd/size (nd/arange ndm 0 0))))❷
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))❸))
#+end_example

* Kill

~kill-sexp (C-M-k)~, Kill the sexp (balanced expression) following
point. When the cursor is at ❶:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   (is (= ❶(+ 0 0) (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~C-M-k~ will remain the code as below:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   (is (= ❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~sp-kill-sexp(M-k)~ does the same operations as ~kill-sexp~.

But ~sp-kill-hybrid-sexp(C-k)~ will kill all expresses after point till
end of the list:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   (is (= ❶))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~sp-backward-kill-sexp~ and ~backward-kill-sexp(ESC C-<backspace>)~ kills
the sexp (balanced expression) preceding point. ~(+ 0 0)~ is killed when
press ~ESC C-<backspace>~:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~sp-backward-copy-sexp(C-M-<backspace>)~, will copy previous balanced
expression. For example, this command will copy ~(+ 0 0)~ to kill ring.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~sp-copy-sexp(C-M-w)~ does the same operation forwardly comparing to
~sp-backward-copy-sexp~. ~(nd/size (nd/arange ndm 0 0))~ is copied in
below example.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

