_posts/technology/2021-11-27-sexp-operations-in-emacs.html
---
layout: post
title: s-exp operations in emacs
categories: [technology]
tags: [lisp, clojure, emacs]
---

<p>
Structural editing is very useful for lisp dialect languages, such as
emacs-lisp, scheme, clojure and so on. Vanilla emacs ships Lisp
editing commands for Emacs(lisp.el) and <a href="https://github.com/Fuco1/smartparens">smartparens</a> provides a minor
mode for Emacs that deals with parens pairs and tries to be smart
about it. If we combine the power of lisp.el and smartparens, we will
gain super productivity.
</p>

<p>
Let&rsquo;s demo these keys and functions with code examples.
</p>

<div id="outline-container-org8584946" class="outline-2">
<h2 id="org8584946"><span class="section-number-2">1.</span> Navigation</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>down-lisp(C-M-d)</code> will go down from ❶ to ❷ ❸ ❹ till ❺, and stop at ❺,
because there is no inner place to go.
</p>

<p>
<code>sp-down-sexp</code> from smartparens achieves the same thing as <code>lisp-down</code>.
</p>

<pre class="example" id="org752cdae">
❶(❷deftest size-test
  (❸let [❹ndm (❺nd/new-base-manager)]
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>backward-up-list(C-M-u)</code> will move the point backward, in from of each
parenthesis. If the point starts from ❺, wherever inside the internal
expression, it will move to ❹ ❸ ❷ ❶, respectively on each press of
<code>C-M-u</code>.
</p>

<pre class="example" id="org3b9f90a">
❶(deftest size-test
  ❷(let ❸[ndm ❹(nd/new-ba❺se-manager)]
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>up-list</code> is actually <code>forward-up-list</code>, if compares to <code>backward-up-list~</code>,
it will let the point move forward out of one level of parentheses,
from ❶, wherever inside the internal expression, to ❷ ❸ ❹ till ❺. This
function is not bound to any keys as default.
</p>

<pre class="example" id="orgd93e266">
(deftest size-test
  (let [ndm (nd/new-ba❶se-manager)❷]❸
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100)))))❹)❺
</pre>

<p>
<code>forward-sexp (C-M-f)</code> will move forward across one balanced expression (sexp).
</p>

<p>
Continue press <code>C-M-f</code>, will move point from ❶ to ❷ and ❸, and stop at
❸. While the smartparens version <code>sp-forward-sexp</code>, will jump one level
out from ❸.
</p>

<pre class="example" id="org0369ff2">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    ❶(is (= 0 (nd/size (nd/arange ndm 0 0))))❷
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))❸))
</pre>

<p>
<code>backward-sexp (C-M-b)</code> move backward across one balanced expression (sexp).
</p>

<p>
The point will move from ❶ to ❺, and stop here, because there is no
backward sexp at the same level.
</p>

<p>
<code>sp-backward-sexp</code> will jump one level up.
</p>

<pre class="example" id="orgfe945ea">
(deftest size-test
 (❺let ❹[ndm (nd/new-base-manager)]
   ❸(is (= 0 (nd/size (nd/arange ndm 0 0))))
   ❷(is (= 100
           (nd/size (nd/arange ndm 0 100))))❶))
</pre>

<p>
<code>beginning-of-defun (C-M-a)</code> move backward to the beginning of a
defun. Actually, it moves to the beginning of whatever a top level
parenthesis.
</p>

<p>
<code>end-of-defun (C-M-e)</code> move forward to next end of defun, at the next
line of last <code>)</code> of the defun.
</p>

<p>
From anywhere between ❶ and ❷, <code>C-M-a</code> will move the point to ❶ and
<code>C-M-e</code> moves it to ❷:
</p>

<pre class="example" id="org26a6296">
❶(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
❷
</pre>
</div>
</div>

<div id="outline-container-org228aa74" class="outline-2">
<h2 id="org228aa74"><span class="section-number-2">2.</span> Mark</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>mark-sexp (C-M-SPC)</code> can be used to mark next sexp and more if
repeatedly pressed.
</p>

<p>
If the cursor is at ❶, press <code>C-M-SPC</code> once will mark the region from ❶
to ❷, press twice, will mark the region from ❶ to ❸.
</p>

<p>
<code>sp-mark-sexp</code> works the same as this function.
</p>

<pre class="example" id="org915f807">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   ❶(is (= 0 (nd/size (nd/arange ndm 0 0))))❷
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))❸))
</pre>
</div>
</div>

<div id="outline-container-orgd9925b9" class="outline-2">
<h2 id="orgd9925b9"><span class="section-number-2">3.</span> Kill</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>kill-sexp (C-M-k)</code>, Kill the sexp (balanced expression) following
point. When the cursor is at ❶:
</p>

<pre class="example" id="org4330a5a">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   (is (= ❶(+ 0 0) (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>C-M-k</code> will remain the code as below:
</p>

<pre class="example" id="org6d461ec">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   (is (= ❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>sp-kill-sexp(M-k)</code> does the same operations as <code>kill-sexp</code>.
</p>

<p>
But <code>sp-kill-hybrid-sexp(C-k)</code> will kill all expresses after point till
end of the list:
</p>

<pre class="example" id="org5f23ad6">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   (is (= ❶))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>sp-backward-kill-sexp</code> and <code>backward-kill-sexp(ESC C-&lt;backspace&gt;)</code> kills
the sexp (balanced expression) preceding point. <code>(+ 0 0)</code> is killed when
press <code>ESC C-&lt;backspace&gt;</code>:
</p>

<pre class="example" id="org1afd291">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>sp-backward-copy-sexp(C-M-&lt;backspace&gt;)</code>, will copy previous balanced
expression. For example, this command will copy <code>(+ 0 0)</code> to kill ring.
</p>

<pre class="example" id="org10da2fc">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>sp-copy-sexp(C-M-w)</code> does the same operation forwardly comparing to
<code>sp-backward-copy-sexp</code>. <code>(nd/size (nd/arange ndm 0 0))</code> is copied in
below example.
</p>

<pre class="example" id="org13f34f5">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)❶ (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>
</div>
</div>
