_notes/_posts/technology/2021-11-27-sexp-operations-in-emacs.org
* slurp and barf

~sp-forward-slurp-sexp(C-<right>)~ adds sexp following the current list
in it by moving the closing delimiter. When the point is at ❶:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶) 0 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

~C-<right>~ will slurp the next ~0~ in the parenthesis. The new position
of the right parenthesis is at ❷.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶ 0❷) 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

Continue press ~C-<right>~, twice, the next ~0~ and ~()~ will be slurped:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶ 0❷ 0❸ (nd/size (nd/arange ndm 0 0))❹)))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

Press ~C-<right>~ again, it will slurp next ~(is ..)~ sexp, and put the
right parenthesis to ❺:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶ 0 0 (nd/size (nd/arange ndm 0 0))
              (is (= 100
                     (nd/size (nd/arange ndm 0 100))))❺)))))

#+end_example

~sp-forward-barf-sexp(C-<left>)~ does the opposite operation that the
delimiter will move one level inside. When the point is at ❺,
continuously press ~C-<left>~ will move the point from ❶ to ❺:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❺ 0❹ 0❸ (nd/size (nd/arange ndm 0 0))❷
              (is (= 100
                     (nd/size (nd/arange ndm 0 100))))❶)))))
#+end_example

~sp-backward-slurp-sexp(M-<left>)~ will slurp sexp from left side. When
the point is at ❶:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

~M-<left>~ will slurp ~=~ inside left parenthesis:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ((= + 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

Next, it will slurp ~is~:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    ((is (= + 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

and ~is~ again:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (((is = + 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

That means the backward slurp will always slurp the nearest sexp, if
there is no sexp in the inner parenthesis, it will slurp outer sexp.

~sp-backward-barf-sexp(M-<right>)~ is the opposite operation to
~sp-backward-slurp-sexp~.

* wrap and unwrap

~sp-wrap-arround~, ~sp-wrap-curly~ and ~sp-wrap-square~ wraps the region
with ~()~, ~{}~ or ~[]~.

~sp-unwrap-sexp~ unwrap next sexp, while ~sp-backward-unwrap-sexp~ unwraps
previous sexp.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0) ❶ (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

If point is at ❶, ~sp-unwrap-sexp~ will remove parenthesis of next expression.

#+begin_example
❿(deftest size-test
  ❾(let [ndm (nd/new-base-manager)]
    ❽(is ❼(= (+ 0 0) ❶ nd/size ❷(nd/arange ndm 0 0)
           ❸(is ❹(= 100
                  ❺(nd/size ❻(nd/arange ndm 0 100))))))))
#+end_example

If continuously invoke it, emacs will remove parenthesis at ❷, ❸, ❹, ❺
and ❻. And it will continue to remove outer parenthesis ❼, ❽, ❾, and
❿.

~sp-backward-unwrap-sexp~ will remove parenthesis of previous expression
~(+ 0 0)~.

#+begin_example
❼(deftest size-test
  ❻(let ❹[ndm ❺(nd/new-base-manager)]
    ❸(is ❷(= + 0 0 ❶ (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

If continuously invoked, if will remove ❷, ❸, ❹, ❺, ❻ till ❼. Remind
the order of ❹ and ❺, because ❹ is the previous parenthesis when ❸ is
removed and ❺ is the previous parenthesis, when ❹ is removed.

* splice

~sp-splice-sexp~ will remove the outer parenthesis, and splice the sexp
from the list. When point is at ❶, this command will remove
parenthesis pair of ❷.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ❷(= (+ 0 0) ❶ (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

~sp-splice-sexp-killing-around~ will keep next expression ~(nd/size
(nd/arange ndm 0 0))~ and kill all other expressions and spaces inside
current list.

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ❶(nd/size (nd/arange ndm 0 0)))))
#+end_example

~sp-splice-sexp-killing-forward(M-<down>)~ will remove parenthesis and
kill following expressions:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is = (+ 0 0)❶)))
#+end_example


~sp-splice-sexp-killing-backward(M-<up>)~ will remove parenthesis and
kill preceeding expressions:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ❶(nd/size (nd/arange ndm 0 0))
        (is (= 100
               (nd/size (nd/arange ndm 0 100)))))))
#+end_example

* split and join

~sp-split-sexp~ will add two parenthesis before and after ~) (~:

#+begin_example
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)) ❶ ((nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
#+end_example

~sp-join-sexp~ is the reverse operation of ~sp-split-sexp~.

