_posts/technology/2021-11-27-sexp-operations-in-emacs.html

<div id="outline-container-org9b938b6" class="outline-2">
<h2 id="org9b938b6"><span class="section-number-2">4.</span> slurp and barf</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>sp-forward-slurp-sexp(C-&lt;right&gt;)</code> adds sexp following the current list
in it by moving the closing delimiter. When the point is at ❶:
</p>

<pre class="example" id="org9fa4630">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶) 0 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
<code>C-&lt;right&gt;</code> will slurp the next <code>0</code> in the parenthesis. The new position
of the right parenthesis is at ❷.
</p>

<pre class="example" id="org4ab19e5">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶ 0❷) 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
Continue press <code>C-&lt;right&gt;</code>, twice, the next <code>0</code> and <code>()</code> will be slurped:
</p>

<pre class="example" id="org479ddbe">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶ 0❷ 0❸ (nd/size (nd/arange ndm 0 0))❹)))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>

<p>
Press <code>C-&lt;right&gt;</code> again, it will slurp next <code>(is ..)</code> sexp, and put the
right parenthesis to ❺:
</p>

<pre class="example" id="org3dc31cf">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❶ 0 0 (nd/size (nd/arange ndm 0 0))
              (is (= 100
                     (nd/size (nd/arange ndm 0 100))))❺)))))

</pre>

<p>
<code>sp-forward-barf-sexp(C-&lt;left&gt;)</code> does the opposite operation that the
delimiter will move one level inside. When the point is at ❺,
continuously press <code>C-&lt;left&gt;</code> will move the point from ❶ to ❺:
</p>

<pre class="example" id="orgbce9dea">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+❺ 0❹ 0❸ (nd/size (nd/arange ndm 0 0))❷
              (is (= 100
                     (nd/size (nd/arange ndm 0 100))))❶)))))
</pre>

<p>
<code>sp-backward-slurp-sexp(M-&lt;left&gt;)</code> will slurp sexp from left side. When
the point is at ❶:
</p>

<pre class="example" id="orge4f26d3">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
<code>M-&lt;left&gt;</code> will slurp <code>=</code> inside left parenthesis:
</p>

<pre class="example" id="orgbb9c16f">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ((= + 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
Next, it will slurp <code>is</code>:
</p>

<pre class="example" id="org7d28b3f">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    ((is (= + 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
and <code>is</code> again:
</p>

<pre class="example" id="orgcd72412">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (((is = + 0❶ 0) (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
That means the backward slurp will always slurp the nearest sexp, if
there is no sexp in the inner parenthesis, it will slurp outer sexp.
</p>

<p>
<code>sp-backward-barf-sexp(M-&lt;right&gt;)</code> is the opposite operation to
<code>sp-backward-slurp-sexp</code>.
</p>
</div>
</div>

<div id="outline-container-org6c72711" class="outline-2">
<h2 id="org6c72711"><span class="section-number-2">5.</span> wrap and unwrap</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>sp-wrap-arround</code>, <code>sp-wrap-curly</code> and <code>sp-wrap-square</code> wraps the region
with <code>()</code>, <code>{}</code> or <code>[]</code>.
</p>

<p>
<code>sp-unwrap-sexp</code> unwrap next sexp, while <code>sp-backward-unwrap-sexp</code> unwraps
previous sexp.
</p>

<pre class="example" id="org1574c56">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0) ❶ (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
If point is at ❶, <code>sp-unwrap-sexp</code> will remove parenthesis of next expression.
</p>

<pre class="example" id="org2423d9c">
❿(deftest size-test
  ❾(let [ndm (nd/new-base-manager)]
    ❽(is ❼(= (+ 0 0) ❶ nd/size ❷(nd/arange ndm 0 0)
           ❸(is ❹(= 100
                  ❺(nd/size ❻(nd/arange ndm 0 100))))))))
</pre>

<p>
If continuously invoke it, emacs will remove parenthesis at ❷, ❸, ❹, ❺
and ❻. And it will continue to remove outer parenthesis ❼, ❽, ❾, and
❿.
</p>

<p>
<code>sp-backward-unwrap-sexp</code> will remove parenthesis of previous expression
<code>(+ 0 0)</code>.
</p>

<pre class="example" id="org4b551bf">
❼(deftest size-test
  ❻(let ❹[ndm ❺(nd/new-base-manager)]
    ❸(is ❷(= + 0 0 ❶ (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
If continuously invoked, if will remove ❷, ❸, ❹, ❺, ❻ till ❼. Remind
the order of ❹ and ❺, because ❹ is the previous parenthesis when ❸ is
removed and ❺ is the previous parenthesis, when ❹ is removed.
</p>
</div>
</div>

<div id="outline-container-org72a77a6" class="outline-2">
<h2 id="org72a77a6"><span class="section-number-2">6.</span> splice</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>sp-splice-sexp</code> will remove the outer parenthesis, and splice the sexp
from the list. When point is at ❶, this command will remove
parenthesis pair of ❷.
</p>

<pre class="example" id="org5e594cb">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ❷(= (+ 0 0) ❶ (nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
<code>sp-splice-sexp-killing-around</code> will keep next expression <code>(nd/size
(nd/arange ndm 0 0))</code> and kill all other expressions and spaces inside
current list.
</p>

<pre class="example" id="org05d4fdb">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ❶(nd/size (nd/arange ndm 0 0)))))
</pre>

<p>
<code>sp-splice-sexp-killing-forward(M-&lt;down&gt;)</code> will remove parenthesis and
kill following expressions:
</p>

<pre class="example" id="orgd44fb77">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is = (+ 0 0)❶)))
</pre>


<p>
<code>sp-splice-sexp-killing-backward(M-&lt;up&gt;)</code> will remove parenthesis and
kill preceeding expressions:
</p>

<pre class="example" id="orgbe231bd">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is ❶(nd/size (nd/arange ndm 0 0))
        (is (= 100
               (nd/size (nd/arange ndm 0 100)))))))
</pre>
</div>
</div>

<div id="outline-container-org7e48fc5" class="outline-2">
<h2 id="org7e48fc5"><span class="section-number-2">7.</span> split and join</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>sp-split-sexp</code> will add two parenthesis before and after <code>) (</code>:
</p>

<pre class="example" id="org3565079">
(deftest size-test
  (let [ndm (nd/new-base-manager)]
    (is (= (+ 0 0)) ❶ ((nd/size (nd/arange ndm 0 0))
           (is (= 100
                  (nd/size (nd/arange ndm 0 100))))))))
</pre>

<p>
<code>sp-join-sexp</code> is the reverse operation of <code>sp-split-sexp</code>.
</p>
</div>
</div>
