_notes/_posts/technology/2021-11-27-sexp-operations-in-emacs.org
* convolute
~sp-convolut-sexp~ will put proceeding sexp outside of outer proceeding
sexp:

#+begin_src clojure
(deftest size-test
  (let [ndm (nd/new-base-manager)]
   ❶(is (= 0 (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_src

#+begin_example
(let [ndm (nd/new-base-manager)]
  (deftest size-test
   ❶(is (= (+ 0 0)  (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
#+end_example

