_posts/technology/2021-11-27-sexp-operations-in-emacs.html

<div id="outline-container-org20828dd" class="outline-2">
<h2 id="org20828dd"><span class="section-number-2">8.</span> convolute</h2>
<div class="outline-text-2" id="text-8">
<p>
<code>sp-convolut-sexp</code> will put proceeding sexp outside of outer proceeding
sexp:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">deftest</span> <span style="color: #0000ff; font-weight: bold;">size-test</span>
  <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">let</span> <span style="color: #909183;">[</span>ndm <span style="color: #709870;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/new-base-manager<span style="color: #709870;">)</span><span style="color: #909183;">]</span>
   &#10102;<span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">is</span> <span style="color: #709870;">(</span>= 0 <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 0 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">is</span> <span style="color: #709870;">(</span>= 100
           <span style="color: #907373;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size <span style="color: #6276ba;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 0 100<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example" id="orga94e28b">
(let [ndm (nd/new-base-manager)]
  (deftest size-test
   ❶(is (= (+ 0 0)  (nd/size (nd/arange ndm 0 0))))
    (is (= 100
           (nd/size (nd/arange ndm 0 100))))))
</pre>
</div>
</div>
