_notes/_posts/technology/2021-11-27-sexp-operations-in-emacs.org
* Summary

| Key                 | Map                             | Description                                                    |
|---------------------+---------------------------------+----------------------------------------------------------------|
| Navigation          |                                 |                                                                |
|---------------------+---------------------------------+----------------------------------------------------------------|
| ~C-M-d~               | ~down-list~                       | Move forward down one level of parentheses.                    |
| ~C-M-u~               | ~backward-up-list~                | Move backward out of one level of parentheses.                 |
| ~C-M-f~               | ~forward-sexp~                    | Move forward across one balanced expression (sexp).            |
|                     | ~sp-forward-sexp~                 | Same as above, will forward up.                                |
| ~C-M-b~               | ~backward-sexp~                   | Move backward across one balanced expression (sexp).           |
|                     | ~sp-backward-sexp~                | Same as above, will backward up.                               |
| ~C-M-n~               | ~forward-list~                    | Move forward across one balanced group of parentheses.         |
| ~C-M-p~               | ~backward-list~                   | Move backward across one balanced group of parentheses.        |
| ~C-M-a~               | ~beginning-of-defun~              | Move backward to the beginning of a defun.                     |
| ~C-M-e~               | ~end-of-defun~                    | Move forward to next end of defun.                             |
|---------------------+---------------------------------+----------------------------------------------------------------|
| Kill and Yank       |                                 |                                                                |
|---------------------+---------------------------------+----------------------------------------------------------------|
| ~C-M-k~               | ~kill-sexp~                       | Kill the sexp (balanced expression) following point.           |
| ~M-k~                 | ~sp-kill-sexp~                    | Kill the balanced expression following point.                  |
| ~C-k~                 | ~sp-kill-hybrid-sexp~             | Kill a line as if with ‘kill-line’, but respecting delimiters. |
| ~ESC C-<backspace>~   | ~backward-kill-sexp~              | Kill the sexp (balanced expression) preceding point.           |
|                     | ~sp-backward-kill-sexp~           | Kill the balanced expression preceding point.                  |
| ~C-M-<backspace>~     | ~sp-backward-copy-sexp~           | Copy the previous ARG expressions to the kill-ring.            |
| ~C-M-w~               | ~sp-copy-sexp~                    | Copy the following ARG expressions to the kill-ring.           |
|---------------------+---------------------------------+----------------------------------------------------------------|
| Slurp and Barf      |                                 |                                                                |
|---------------------+---------------------------------+----------------------------------------------------------------|
| ~C-<right>~           | ~sp-forward-slurp-sexp~           | Add following sexp by moving the closing delimiter.            |
| ~C-<left>~            | ~sp-forward-barf-sexp~            | Remove the last sexp by moving the closing delimiter.          |
| ~M-<left>~            | ~sp-backward-slurp-sexp~          | Add preceding sexp  by moving the opening delimiter.           |
| ~M-<right>~           | ~sp-backward-barf-sexp~           | Remove the first sexp by moving the opening delimiter.         |
|---------------------+---------------------------------+----------------------------------------------------------------|
| Wrap and Unwrap     |                                 |                                                                |
|---------------------+---------------------------------+----------------------------------------------------------------|
|                     | ~sp-wrap-arround~                 | Wrap region with ~()~                                            |
|                     | ~sp-wrap-curly~                   | Wrap region with ~{}~                                            |
|                     | ~sp-wrap-square~                  | Wrap region with ~[]~                                            |
|                     | ~sp-unwrap-sexp~                  | remove parenthesis of next expression                          |
|                     | ~sp-backward-unwrap-sexp~         | Remove parenthesis of previous expression                      |
|---------------------+---------------------------------+----------------------------------------------------------------|
| Splice, Split, Join |                                 |                                                                |
|---------------------+---------------------------------+----------------------------------------------------------------|
|                     | ~sp-splice-sexp~                  | Remove delimiters                                              |
|                     | ~sp-splice-sexp-killing-around~   | Remove delimiters and keep next expression                     |
| ~M-<down>~            | ~sp-splice-sexp-killing-forward~  | Remove delimiters and kill following expressions               |
| ~M-<up>~              | ~sp-splice-sexp-killing-backward~ | Remove delimiters and kill proceeding expressions              |
|                     | ~sp-split-sexp~                   | Add ~)~ and ~(~                                                    |
|                     | ~sp-join-sexp~                    | Remove ~)~ and ~(~                                                 |
|                     | ~sp-convolute-sexp~               | Put proceeding sexp outside of outer proceeding sexp           |
