_posts/technology/2021-11-27-sexp-operations-in-emacs.html

<div id="outline-container-org8fd5fe1" class="outline-2">
<h2 id="org8fd5fe1"><span class="section-number-2">9.</span> Summary</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Map</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Navigation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-M-d</code></td>
<td class="org-left"><code>down-list</code></td>
<td class="org-left">Move forward down one level of parentheses.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-u</code></td>
<td class="org-left"><code>backward-up-list</code></td>
<td class="org-left">Move backward out of one level of parentheses.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-f</code></td>
<td class="org-left"><code>forward-sexp</code></td>
<td class="org-left">Move forward across one balanced expression (sexp).</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-forward-sexp</code></td>
<td class="org-left">Same as above, will forward up.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-b</code></td>
<td class="org-left"><code>backward-sexp</code></td>
<td class="org-left">Move backward across one balanced expression (sexp).</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-backward-sexp</code></td>
<td class="org-left">Same as above, will backward up.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-n</code></td>
<td class="org-left"><code>forward-list</code></td>
<td class="org-left">Move forward across one balanced group of parentheses.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-p</code></td>
<td class="org-left"><code>backward-list</code></td>
<td class="org-left">Move backward across one balanced group of parentheses.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-a</code></td>
<td class="org-left"><code>beginning-of-defun</code></td>
<td class="org-left">Move backward to the beginning of a defun.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-e</code></td>
<td class="org-left"><code>end-of-defun</code></td>
<td class="org-left">Move forward to next end of defun.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Kill and Yank</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-M-k</code></td>
<td class="org-left"><code>kill-sexp</code></td>
<td class="org-left">Kill the sexp (balanced expression) following point.</td>
</tr>

<tr>
<td class="org-left"><code>M-k</code></td>
<td class="org-left"><code>sp-kill-sexp</code></td>
<td class="org-left">Kill the balanced expression following point.</td>
</tr>

<tr>
<td class="org-left"><code>C-k</code></td>
<td class="org-left"><code>sp-kill-hybrid-sexp</code></td>
<td class="org-left">Kill a line as if with ‘kill-line’, but respecting delimiters.</td>
</tr>

<tr>
<td class="org-left"><code>ESC C-&lt;backspace&gt;</code></td>
<td class="org-left"><code>backward-kill-sexp</code></td>
<td class="org-left">Kill the sexp (balanced expression) preceding point.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-backward-kill-sexp</code></td>
<td class="org-left">Kill the balanced expression preceding point.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-&lt;backspace&gt;</code></td>
<td class="org-left"><code>sp-backward-copy-sexp</code></td>
<td class="org-left">Copy the previous ARG expressions to the kill-ring.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-w</code></td>
<td class="org-left"><code>sp-copy-sexp</code></td>
<td class="org-left">Copy the following ARG expressions to the kill-ring.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Slurp and Barf</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-&lt;right&gt;</code></td>
<td class="org-left"><code>sp-forward-slurp-sexp</code></td>
<td class="org-left">Add following sexp by moving the closing delimiter.</td>
</tr>

<tr>
<td class="org-left"><code>C-&lt;left&gt;</code></td>
<td class="org-left"><code>sp-forward-barf-sexp</code></td>
<td class="org-left">Remove the last sexp by moving the closing delimiter.</td>
</tr>

<tr>
<td class="org-left"><code>M-&lt;left&gt;</code></td>
<td class="org-left"><code>sp-backward-slurp-sexp</code></td>
<td class="org-left">Add preceding sexp  by moving the opening delimiter.</td>
</tr>

<tr>
<td class="org-left"><code>M-&lt;right&gt;</code></td>
<td class="org-left"><code>sp-backward-barf-sexp</code></td>
<td class="org-left">Remove the first sexp by moving the opening delimiter.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Wrap and Unwrap</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-wrap-arround</code></td>
<td class="org-left">Wrap region with <code>()</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-wrap-curly</code></td>
<td class="org-left">Wrap region with <code>{}</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-wrap-square</code></td>
<td class="org-left">Wrap region with <code>[]</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-unwrap-sexp</code></td>
<td class="org-left">remove parenthesis of next expression</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-backward-unwrap-sexp</code></td>
<td class="org-left">Remove parenthesis of previous expression</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Splice, Split, Join</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-splice-sexp</code></td>
<td class="org-left">Remove delimiters</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-splice-sexp-killing-around</code></td>
<td class="org-left">Remove delimiters and keep next expression</td>
</tr>

<tr>
<td class="org-left"><code>M-&lt;down&gt;</code></td>
<td class="org-left"><code>sp-splice-sexp-killing-forward</code></td>
<td class="org-left">Remove delimiters and kill following expressions</td>
</tr>

<tr>
<td class="org-left"><code>M-&lt;up&gt;</code></td>
<td class="org-left"><code>sp-splice-sexp-killing-backward</code></td>
<td class="org-left">Remove delimiters and kill proceeding expressions</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-split-sexp</code></td>
<td class="org-left">Add <code>)</code> and <code>(</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-join-sexp</code></td>
<td class="org-left">Remove <code>)</code> and <code>(</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>sp-convolute-sexp</code></td>
<td class="org-left">Put proceeding sexp outside of outer proceeding sexp</td>
</tr>
</tbody>
</table>
</div>
</div>
